Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_mq_broker.rabbitmq will be created
+ resource "aws_mq_broker" "rabbitmq" {
      + apply_immediately          = false
      + arn                        = (known after apply)
      + authentication_strategy    = (known after apply)
      + auto_minor_version_upgrade = false
      + broker_name                = "rabbitmq"
      + deployment_mode            = "SINGLE_INSTANCE"
      + engine_type                = "RabbitMQ"
      + engine_version             = "3.8.6"
      + host_instance_type         = "mq.t3.micro"
      + id                         = (known after apply)
      + instances                  = (known after apply)
      + publicly_accessible        = false
      + security_groups            = (known after apply)
      + storage_type               = (known after apply)
      + subnet_ids                 = (known after apply)
      + tags_all                   = (known after apply)

      + configuration {
          + id       = (known after apply)
          + revision = (known after apply)
        }

      + maintenance_window_start_time {
          + day_of_week = (known after apply)
          + time_of_day = (known after apply)
          + time_zone   = (known after apply)
        }

      + user {
          + console_access = false
          + groups         = []
          + password       = (sensitive value)
          + username       = "rhea-so"
        }
    }

  # aws_security_group.rabbitmq-security-group will be created
+ resource "aws_security_group" "rabbitmq-security-group" {
      + arn                    = (known after apply)
      + description            = "Allow RabbitMQ inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "39.7.24.115/32",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "rabbitmq-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rabbitmq-security-group"
        }
      + tags_all               = {
          + "Name" = "rabbitmq-security-group"
        }
      + vpc_id                 = "vpc-0119ba5078755447e"
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
